package com.example.activity;



import android.os.Bundle;
import android.support.v4.app.FragmentActivity;
import android.support.v4.content.LocalBroadcastManager;
import android.view.View;
import android.view.Window;
import android.widget.RelativeLayout;
import android.widget.TextView;

import com.example.listmultichoise.R;


public class ResultReportActivity extends FragmentActivity  {
	LocalBroadcastManager mLocalBroadcastManager;
	int count = MainActivity.questionlist.size();
	int[] mIds = new int[count];


	@Override
	protected void onCreate(Bundle savedInstanceState) {
		super.onCreate(savedInstanceState);
		getWindow().requestFeature(Window.FEATURE_NO_TITLE);

		setContentView(R.layout.activity_report);
//		 mLocalBroadcastManager = LocalBroadcastManager.getInstance(this);

		TextView textView = (TextView) findViewById(R.id.textView);
		TextView tv_back = (TextView) findViewById(R.id.tv_back);
		RelativeLayout rl_result_panel = (RelativeLayout) findViewById(R.id.rl_result_panel);
		//设置scrollview 自动置顶
		rl_result_panel.setFocusable(true);
		rl_result_panel.setFocusableInTouchMode(true);
		rl_result_panel.requestFocus();
		tv_back.setOnClickListener(new View.OnClickListener() {
			@Override
			public void onClick(View view) {
				System.exit(0);
			}
		});
		int[] j = new int[9];
		int num = 0;
		for (int i:MainActivity.results){
			num++;
			if (num<=8){
				j[0]+=i;
			}
			else if (num<=16){
				j[1]+=i;
			}
			else if (num<=23){
				j[2]+=i;
			}
			else if (num<=31){
				j[3]+=i;
			}
			else if (num<=39){
				j[4]+=i;
			}
			else if (num<=45){
				j[5]+=i;
			}
			else if (num<=52){
				j[6]+=i;
			}
			else if (num<=59){
				j[7]+=i;
			}
			else if (num<=66){
				j[8]+=i;
			}

		}
		int[]transfer=new int[9];
		transfer[0]=((j[0]-8)*100)/(4*8);
		transfer[1]=((j[1]-8)*100)/(4*8);
		transfer[2]=((j[2]-7)*100)/(4*7);
		transfer[3]=((j[3]-8)*100)/(4*8);
		transfer[4]=((j[4]-8)*100)/(4*8);
		transfer[5]=((j[5]-6)*100)/(4*6);
		transfer[6]=((j[6]-7)*100)/(4*7);
		transfer[7]=((j[7]-7)*100)/(4*7);
		transfer[8]=((j[8]-7)*100)/(4*7);

		textView.setText("（平和质）原始分："+j[0]+"   转化分："+transfer[0]+"\n");
		textView.append("（气虚质）原始分："+j[1]+"   转化分："+transfer[1]+"\n");
		textView.append("（阳虚质）原始分："+j[2]+"   转化分："+transfer[2]+"\n");
		textView.append("（阴虚质）原始分："+j[3]+"   转化分："+transfer[3]+"\n");
		textView.append("（痰湿质）原始分："+j[4]+"   转化分："+transfer[4]+"\n");
		textView.append("（湿热质）原始分："+j[5]+"   转化分："+transfer[5]+"\n");
		textView.append("（血淤质）原始分："+j[6]+"   转化分："+transfer[6]+"\n");
		textView.append("（气郁质）原始分："+j[7]+"   转化分："+transfer[7]+"\n");
		textView.append("（特禀质）原始分："+j[8]+"   转化分："+transfer[8]+"\n");
		String str = "";
		int em = 0;
		if (transfer[0]>=60){
			for (int i=1;i<=8;i++){
				if (transfer[i]>30){
					em = 1;
					if (transfer[i]>40){
						em=2;
						break;
					}
				}
			}
			if (em == 0){
				str = "是平和质\n【总体特征】：阴阳气血调和，以体态适中、面色红润、精力充沛等为主要特征。\n" +
						"【形体特征】：体形匀称健壮。\n" +
						"\n" +
						"【常见表现】：面色、肤色润泽，头发稠密有光泽，目光有神，鼻色明润，嗅觉通利，唇色红润，不易疲劳，精 力充沛，耐受寒热，睡眠良好，胃纳佳，二便正常，舌色淡红，苔薄白，脉和缓有力。\n" +
						"【心理特征】：性格随和开朗。\n" +
						"【发病倾向】：平素患病较少。\n" +
						"【适应能力】：对自然环境和社会环境适应能力较强。\n" +
						"【辨识方法】：正常的体质。\n" +
						"【调节方法】：饮食有节制，不要常吃过冷过热或不干净的食物，粗细粮食要合理搭配\n";
			}else if (em == 1){
				str = "基本是平和质\n【总体特征】：阴阳气血调和，以体态适中、面色红润、精力充沛等为主要特征。\n" +
						"【形体特征】：体形匀称健壮。\n" +
						"\n" +
						"【常见表现】：面色、肤色润泽，头发稠密有光泽，目光有神，鼻色明润，嗅觉通利，唇色红润，不易疲劳，精 力充沛，耐受寒热，睡眠良好，胃纳佳，二便正常，舌色淡红，苔薄白，脉和缓有力。\n" +
						"【心理特征】：性格随和开朗。\n" +
						"【发病倾向】：平素患病较少。\n" +
						"【适应能力】：对自然环境和社会环境适应能力较强。\n" +
						"【辨识方法】：正常的体质。\n" +
						"【调节方法】：饮食有节制，不要常吃过冷过热或不干净的食物，粗细粮食要合理搭配\n";
			}else {
				int aa = 1;
				for (int p =1;p<=8;p++){
					if (transfer[p]>transfer[aa]){
						aa = p;
					}
				}
				switch (aa){
					case 1:str="是气虚质\n【总体特征】：元气不足，以疲乏、气短、自汗等气虚表现为主要特征。\n" +
							"【形体特征】：肌肉松软不实。\n" +
							"【常见表现】：平素语音低弱，气短懒言，容易疲乏，精神不振，易出汗，舌淡红，舌边有齿痕，脉弱。\n" +
							"【心理特征】：性格内向，不喜冒险。\n" +
							"【发病倾向】：易患感冒、内脏下垂等病；病后康复缓慢。\n" +
							"【适应能力】：不耐受风、寒、暑、湿邪。\n" +
							"【辨识方法】：肌肉松软，声音低，易出汗，易累，易感冒。\n" +
							"【调节方法】：多食用具有益气健脾作用的食物，如黄豆、白扁豆、鸡肉等。少食空心菜、生萝卜等。\n";break;
					case 2:str="是阳虚质\n【总体特征】：阳气不足，以畏寒怕冷、手足不温等虚寒表现为主要特征。\n" +
							"【形体特征】：肌肉松软不实。\n" +
							"【常见表现】：平素畏冷，手足不温，喜热饮食，精神不振，舌淡胖嫩，脉沉迟。\n" +
							"【心理特征】：性格多沉静、内向。\n" +
							"【发病倾向】：易患痰饮、肿胀、泄泻等病；感邪易从寒化。\n" +
							"【适应能力】：耐夏不耐冬；易感风、寒、湿邪。\n" +
							"【辨识方法】：肌肉不健壮，常常感到手脚发凉，衣服比别人穿得多，夏天不喜欢吹空调，喜欢安静，性格多沉 静、内向。\n" +
							"【调节方法】：平时可多食牛肉、羊肉等温阳之品，少食梨、西瓜、荸荠等生冷寒凉食物，少饮绿茶。\n";break;
					case 3:str="是阴虚质\n【总体特征】：阴液亏少，以口燥咽干、手足心热等虚热表现为主要特征。\n" +
							"【形体特征】：体形偏瘦。\n" +
							"【常见表现】：手足心热，口燥咽干，鼻微干，喜冷饮，大便干燥，舌红少津，脉细数。\n" +
							"【心理特征】：性情急躁，外向好动，活泼。\n" +
							"【发病倾向】：易患虚劳、失精、不寐等病；感邪易从热化。\n" +
							"【适应能力】：耐冬不耐夏；不耐受暑、热、燥邪。\n" +
							"【辨识方法】：体形多瘦长，不耐暑热，常感到眼睛干涩，口干咽燥，总想喝水，皮肤干燥，经常大便干结，容 易失眠。\n" +
							"【调节方法】：多食瘦猪肉、鸭肉、绿豆、冬瓜等甘凉滋润之品，少食羊肉、韭菜、辣椒、葵花子等性温燥烈之 品。适合太极拳、太极剑、气功等项目。\n";break;
					case 4:str="是痰湿质\n【总体特征】：痰湿凝聚，以形体肥胖、腹部肥满、口黏苔腻等痰湿表现为主要特征。\n" +
							"【形体特征】：体形肥胖，腹部肥满松软。\n" +
							"【常见表现】：面部皮肤油脂较多，多汗且黏，胸闷，痰多，口黏腻或甜，喜食肥甘甜黏，苔腻，脉滑。\n" +
							"【心理特征】：性格偏温和、稳重，多善于忍耐。\n" +
							"【发病倾向】：易患消渴、中风、胸痹等病。\n" +
							"【适应能力】：对梅雨季节及湿重环境适应能力差。\n" +
							"【辨识方法】：体形肥胖，腹部肥满而松软。易出汗，且多黏腻。经常感觉脸上有一层油。\n" +
							"【调节方法】：饮食应以清淡为主，可多食冬瓜等。因体形肥胖，易于困倦，故应根据自己的具体情况循序渐进， 长期坚持运动锻炼\n";break;
					case 5:str="是湿热质\n【总体特征】：湿热内蕴，以面垢油光、口苦、苔黄腻等湿热表现为主要特征。\n" +
							"【形体特征】：形体中等或偏瘦。\n" +
							"【常见表现】：面垢油光，易生痤疮，口苦口干，身重困倦，大便黏滞不畅或燥结，小便短黄，男性易阴囊潮湿， 女性易带下增多，舌质偏红，苔黄腻，脉滑数。\n" +
							"【心理特征】：容易心烦急躁。\n" +
							"【发病倾向】：易患疮疖、黄疸、热淋等病。\n" +
							"【适应能力】：对夏末秋初湿热气候，湿重或气温偏高环境较难适应。\n" +
							"【辨识方法】：面部和鼻尖总是油光发亮，脸上易生粉刺，皮肤易瘙痒。常感到口苦、口臭，脾气较急躁。\n" +
							"【调节方法】：饮食以清淡为主，可多食赤小豆、绿豆、芹菜、黄瓜、藕等甘寒的食物。适合中长跑、游泳、爬 山、各种球类、武术等。\n";break;
					case 6:str="是血淤质\n【总体特征】：血行不畅，以肤色晦黯、舌质紫黯等血瘀表现为主要特征。\n" +
							"【形体特征】：胖瘦均见。\n" +
							"【常见表现】：肤色晦黯，色素沉着，容易出现瘀斑，口唇黯淡，舌黯或有瘀点，舌下络脉紫黯或增粗，脉涩。\n" +
							"【心理特征】：易烦，健忘。\n" +
							"【发病倾向】：易患癥瘕及痛证、血证等。\n" +
							"【适应能力】：不耐受寒邪。\n" +
							"【辨识方法】：皮肤较粗糙，眼睛里的红丝很多，牙龈易出血。\n" +
							"【调节方法】：多食山楂、醋、玫瑰花等，少食肥肉等滋腻之品。可参加各种舞蹈、步行健身法、徒手健身操等。\n";break;
					case 7:str="是气郁质\n【总体特征】：气机郁滞，以神情抑郁、忧虑脆弱等气郁表现为主要特征。\n" +
							"【形体特征】：形体瘦者为多。\n" +
							"【常见表现】：神情抑郁，情感脆弱，烦闷不乐，舌淡红，苔薄白，脉弦。\n" +
							"【心理特征】：性格内向不稳定、敏感多虑。\n" +
							"【发病倾向】：易患脏躁、梅核气、百合病及郁证等。\n" +
							"【适应能力】：对精神刺激适应能力较差；不适应阴雨天气。\n" +
							"【辨识方法】：体形偏瘦，常感到闷闷不乐、情绪低沉，常有胸闷，经常无缘无故地叹气,易失眠。\n" +
							"【调节方法】：多食黄花菜、海带、山楂、玫瑰花等具有行气、解郁、消食、醒神作用的食物。气郁体质的人不 要总待在家里，要多参加群众性的体育运动项目。\n";break;
					case 8:str="是特禀质\n【总体特征】：先天失常，以生理缺陷、过敏反应等为主要特征。\n" +
							"【形体特征】：过敏体质者一般无特殊；先天禀赋异常者或有畸形，或有生理缺陷。\n" +
							"【常见表现】：过敏体质者常见哮喘、风团、咽痒、鼻塞、喷嚏等；患遗传性疾病者有垂直遗传、先天性、家族 性特征；患胎传性疾病者具有母体影响胎儿个体生长发育及相关疾病特征。\n" +
							"【心理特征】：随禀质不同情况各异。\n" +
							"【发病倾向】：过敏体质者易患哮喘、荨麻疹、花粉症及药物过敏等；遗传疾病如血友病、先天愚型等；胎传疾 病如五迟（立迟、行迟、发迟、齿迟和语迟）、五软（头软、项软、手足软、肌肉软、口软）、解颅、胎惊、 胎痫等。\n" +
							"【适应能力】：适应能力差，如过敏体质者对易致敏季节适应能力差，易引发宿疾。\n" +
							"【辨识方法】：这是一类体质特殊的人群。其中过敏体质的人易对药物、食物、气味、花粉、季节过敏。\n" +
							"【调节方法】：多食益气固表的食物，少食荞麦(含致敏物质荞麦荧光素)、蚕豆等。居室宜通风良好。保持室内 清洁，被褥、床单要经常洗晒，可防止对尘螨过敏。\n";break;
				}
			}
		}
		else{
			int aa = 1;
			for (int p =1;p<=8;p++){
				if (transfer[p]>transfer[aa]){
					aa = p;
				}
			}
			switch (aa){
				case 1:str="是气虚质\n【总体特征】：元气不足，以疲乏、气短、自汗等气虚表现为主要特征。\n" +
						"【形体特征】：肌肉松软不实。\n" +
						"【常见表现】：平素语音低弱，气短懒言，容易疲乏，精神不振，易出汗，舌淡红，舌边有齿痕，脉弱。\n" +
						"【心理特征】：性格内向，不喜冒险。\n" +
						"【发病倾向】：易患感冒、内脏下垂等病；病后康复缓慢。\n" +
						"【适应能力】：不耐受风、寒、暑、湿邪。\n" +
						"【辨识方法】：肌肉松软，声音低，易出汗，易累，易感冒。\n" +
						"【调节方法】：多食用具有益气健脾作用的食物，如黄豆、白扁豆、鸡肉等。少食空心菜、生萝卜等。\n";break;
				case 2:str="是阳虚质\n【总体特征】：阳气不足，以畏寒怕冷、手足不温等虚寒表现为主要特征。\n" +
						"【形体特征】：肌肉松软不实。\n" +
						"【常见表现】：平素畏冷，手足不温，喜热饮食，精神不振，舌淡胖嫩，脉沉迟。\n" +
						"【心理特征】：性格多沉静、内向。\n" +
						"【发病倾向】：易患痰饮、肿胀、泄泻等病；感邪易从寒化。\n" +
						"【适应能力】：耐夏不耐冬；易感风、寒、湿邪。\n" +
						"【辨识方法】：肌肉不健壮，常常感到手脚发凉，衣服比别人穿得多，夏天不喜欢吹空调，喜欢安静，性格多沉 静、内向。\n" +
						"【调节方法】：平时可多食牛肉、羊肉等温阳之品，少食梨、西瓜、荸荠等生冷寒凉食物，少饮绿茶。\n";break;
				case 3:str="是阴虚质\n【总体特征】：阴液亏少，以口燥咽干、手足心热等虚热表现为主要特征。\n" +
						"【形体特征】：体形偏瘦。\n" +
						"【常见表现】：手足心热，口燥咽干，鼻微干，喜冷饮，大便干燥，舌红少津，脉细数。\n" +
						"【心理特征】：性情急躁，外向好动，活泼。\n" +
						"【发病倾向】：易患虚劳、失精、不寐等病；感邪易从热化。\n" +
						"【适应能力】：耐冬不耐夏；不耐受暑、热、燥邪。\n" +
						"【辨识方法】：体形多瘦长，不耐暑热，常感到眼睛干涩，口干咽燥，总想喝水，皮肤干燥，经常大便干结，容 易失眠。\n" +
						"【调节方法】：多食瘦猪肉、鸭肉、绿豆、冬瓜等甘凉滋润之品，少食羊肉、韭菜、辣椒、葵花子等性温燥烈之 品。适合太极拳、太极剑、气功等项目。\n";break;
				case 4:str="是痰湿质\n【总体特征】：痰湿凝聚，以形体肥胖、腹部肥满、口黏苔腻等痰湿表现为主要特征。\n" +
						"【形体特征】：体形肥胖，腹部肥满松软。\n" +
						"【常见表现】：面部皮肤油脂较多，多汗且黏，胸闷，痰多，口黏腻或甜，喜食肥甘甜黏，苔腻，脉滑。\n" +
						"【心理特征】：性格偏温和、稳重，多善于忍耐。\n" +
						"【发病倾向】：易患消渴、中风、胸痹等病。\n" +
						"【适应能力】：对梅雨季节及湿重环境适应能力差。\n" +
						"【辨识方法】：体形肥胖，腹部肥满而松软。易出汗，且多黏腻。经常感觉脸上有一层油。\n" +
						"【调节方法】：饮食应以清淡为主，可多食冬瓜等。因体形肥胖，易于困倦，故应根据自己的具体情况循序渐进， 长期坚持运动锻炼\n";break;
				case 5:str="是湿热质\n【总体特征】：湿热内蕴，以面垢油光、口苦、苔黄腻等湿热表现为主要特征。\n" +
						"【形体特征】：形体中等或偏瘦。\n" +
						"【常见表现】：面垢油光，易生痤疮，口苦口干，身重困倦，大便黏滞不畅或燥结，小便短黄，男性易阴囊潮湿， 女性易带下增多，舌质偏红，苔黄腻，脉滑数。\n" +
						"【心理特征】：容易心烦急躁。\n" +
						"【发病倾向】：易患疮疖、黄疸、热淋等病。\n" +
						"【适应能力】：对夏末秋初湿热气候，湿重或气温偏高环境较难适应。\n" +
						"【辨识方法】：面部和鼻尖总是油光发亮，脸上易生粉刺，皮肤易瘙痒。常感到口苦、口臭，脾气较急躁。\n" +
						"【调节方法】：饮食以清淡为主，可多食赤小豆、绿豆、芹菜、黄瓜、藕等甘寒的食物。适合中长跑、游泳、爬 山、各种球类、武术等。\n";break;
				case 6:str="是血淤质\n【总体特征】：血行不畅，以肤色晦黯、舌质紫黯等血瘀表现为主要特征。\n" +
						"【形体特征】：胖瘦均见。\n" +
						"【常见表现】：肤色晦黯，色素沉着，容易出现瘀斑，口唇黯淡，舌黯或有瘀点，舌下络脉紫黯或增粗，脉涩。\n" +
						"【心理特征】：易烦，健忘。\n" +
						"【发病倾向】：易患癥瘕及痛证、血证等。\n" +
						"【适应能力】：不耐受寒邪。\n" +
						"【辨识方法】：皮肤较粗糙，眼睛里的红丝很多，牙龈易出血。\n" +
						"【调节方法】：多食山楂、醋、玫瑰花等，少食肥肉等滋腻之品。可参加各种舞蹈、步行健身法、徒手健身操等。\n";break;
				case 7:str="是气郁质\n【总体特征】：气机郁滞，以神情抑郁、忧虑脆弱等气郁表现为主要特征。\n" +
						"【形体特征】：形体瘦者为多。\n" +
						"【常见表现】：神情抑郁，情感脆弱，烦闷不乐，舌淡红，苔薄白，脉弦。\n" +
						"【心理特征】：性格内向不稳定、敏感多虑。\n" +
						"【发病倾向】：易患脏躁、梅核气、百合病及郁证等。\n" +
						"【适应能力】：对精神刺激适应能力较差；不适应阴雨天气。\n" +
						"【辨识方法】：体形偏瘦，常感到闷闷不乐、情绪低沉，常有胸闷，经常无缘无故地叹气,易失眠。\n" +
						"【调节方法】：多食黄花菜、海带、山楂、玫瑰花等具有行气、解郁、消食、醒神作用的食物。气郁体质的人不 要总待在家里，要多参加群众性的体育运动项目。\n";break;
				case 8:str="是特禀质\n【总体特征】：先天失常，以生理缺陷、过敏反应等为主要特征。\n" +
						"【形体特征】：过敏体质者一般无特殊；先天禀赋异常者或有畸形，或有生理缺陷。\n" +
						"【常见表现】：过敏体质者常见哮喘、风团、咽痒、鼻塞、喷嚏等；患遗传性疾病者有垂直遗传、先天性、家族 性特征；患胎传性疾病者具有母体影响胎儿个体生长发育及相关疾病特征。\n" +
						"【心理特征】：随禀质不同情况各异。\n" +
						"【发病倾向】：过敏体质者易患哮喘、荨麻疹、花粉症及药物过敏等；遗传疾病如血友病、先天愚型等；胎传疾 病如五迟（立迟、行迟、发迟、齿迟和语迟）、五软（头软、项软、手足软、肌肉软、口软）、解颅、胎惊、 胎痫等。\n" +
						"【适应能力】：适应能力差，如过敏体质者对易致敏季节适应能力差，易引发宿疾。\n" +
						"【辨识方法】：这是一类体质特殊的人群。其中过敏体质的人易对药物、食物、气味、花粉、季节过敏。\n" +
						"【调节方法】：多食益气固表的食物，少食荞麦(含致敏物质荞麦荧光素)、蚕豆等。居室宜通风良好。保持室内 清洁，被褥、床单要经常洗晒，可防止对尘螨过敏。\n";break;
			}
		}

		textView.append(str);


	}
 
}
